package kr.sols.common;

import java.util.Random;

public class NickNameGenerator {
    private static final String[] adjectives = {
            "빠른", "귀여운", "느린", "강한", "활발한", "행복한", "즐거운", "용감한", "똑똑한", "조용한",
            "순한", "화난", "기운찬", "의젓한", "재빠른", "우아한", "매혹적인", "날카로운", "유쾌한", "침착한",
            "튼튼한", "새침한", "다정한", "활기찬", "총명한", "온화한", "성실한", "명랑한", "우스운", "사나운",
            "긍정적인", "낙천적인", "단단한", "자유로운", "명백한", "열정적인", "대담한", "빛나는", "차분한", "따뜻한",
            "신비로운", "깜찍한", "비밀스러운", "상냥한", "당당한", "자비로운", "고요한", "밝은", "아름다운", "힘찬",
            "순수한", "활기찬", "행운의", "믿음직한", "기발한", "용의주도한", "날렵한", "희망찬", "기쁜", "매력적인",
            "부드러운", "강인한", "독특한", "끈기있는", "열심히", "멋진", "차가운", "은은한", "빛나는", "단호한",
            "지혜로운", "의리있는", "용감무쌍한", "활기있는", "품위있는", "능숙한", "유능한", "겸손한", "절묘한", "거침없는",
            "풍요로운", "우아한", "환상적인", "감미로운", "정직한", "낭만적인", "화끈한", "용맹한", "깔끔한", "섬세한",
            "온순한", "즐거운", "믿을만한", "근면한", "냉철한", "신중한", "근사한", "호기심많은", "도전적인", "현명한"
    };

    private static final String[] animals = {
            "사자", "호랑이", "고양이", "개", "코끼리", "토끼", "늑대", "여우", "곰", "원숭이",
            "독수리", "부엉이", "사슴", "표범", "치타", "양", "염소", "돼지", "소", "말",
            "기린", "캥거루", "고릴라", "하마", "거북이", "팬더", "코알라", "펭귄", "수달", "해달",
            "다람쥐", "너구리", "까마귀", "청설모", "독수리", "앵무새", "백조", "돌고래", "상어", "고래",
            "문어", "개구리", "잠자리", "나비", "벌", "매", "삵", "두더지", "알파카", "판다",
            "악어", "참새", "도마뱀", "사마귀", "하이에나", "바다사자", "이구아나", "라쿤", "물개", "타조",
            "말미잘", "두루미", "갈매기", "까치", "노루", "두꺼비", "말벌", "노랑나비", "뱀", "미어캣",
            "코요테", "딱따구리", "청둥오리", "바다거북", "수리", "독개구리", "표범", "범고래", "아르마딜로", "까마귀",
            "족제비", "햄스터", "칠면조", "앵무새", "킹코브라", "청소부", "붉은여우", "황새", "불가사리", "새우",
            "홍학", "물총새", "멧돼지", "딱새", "부채새", "돌고래", "문어", "까마귀", "잉어", "수리"
    };

    // 랜덤 닉네임 생성 함수
    public static String generateRandomNickname() {
        Random random = new Random();
        String randomAdjective = adjectives[random.nextInt(adjectives.length)];
        String randomAnimal = animals[random.nextInt(animals.length)];
        return randomAdjective + " " + randomAnimal;
    }
}

